nilava/immurok-esp32/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Custom partition table (roomy NVS + 3MB app)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# BLE only (S3 has no BT Classic); Bluedroid with GATTS + SMP for Just Works bonding
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_BLE_SMP_ENABLE=y
CONFIG_BT_GATTS_ENABLE=y

# Logs over the built-in USB-Serial-JTAG (no TinyUSB in this project)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# mbedTLS: ECDH P-256 + HMAC are default-on; keep the cert bundle off (not needed)

# HKDF for immurok shared-key derivation
CONFIG_MBEDTLS_HKDF_C=y

# DO NOT enable BLE modem sleep on this board without re-testing from scratch.
# CONFIG_BT_CTRL_MODEM_SLEEP=y + MODEM_SLEEP_MODE_1 + LPCLK_SEL_MAIN_XTAL put
# the device into a boot loop: it panics during GATTS service creation with
#   assert failed: future_ready future.c:65 (future->ready_can_be_called)
#   bta_gatts_create_srvc -> btc_gatts_inter_cb -> future_ready
# i.e. inside Bluedroid's attribute-table creation, before advertising ever
# starts. This firmware builds four attribute tables chained on
# CREAT_ATTR_TAB_EVT, and modem sleep appears to perturb that sequence.
# Tried 2026-09-12, reverted the same day.
